tap "antoniorodr/memo"
tap "goodwithtech/r"
tap "homebrew/services"
tap "messense/macos-cross-toolchains"
tap "snyk/tap"
tap "steipete/tap"
tap "supreme-gg-gg/tap"
brew "a2ps"
brew "act"
brew "arm-linux-gnueabihf-binutils"
brew "glib"
brew "node"
brew "balena-cli"
brew "bat"
brew "biome"
brew "bruno-cli"
brew "btop"
brew "cloc"
brew "coreutils"
brew "ddrescue"
brew "direnv"
brew "docker"
brew "e2fsprogs"
brew "eza"
brew "f3"
brew "fish"
brew "fzf"
brew "gcc"
brew "gemini-cli"
brew "ggshield"
brew "gh"
brew "harfbuzz"
brew "openjpeg"
brew "pango"
brew "tesseract"
brew "ghostscript"
brew "gifsicle"
brew "git-filter-repo"
brew "git-secrets"
brew "gitleaks"
brew "tmux"
brew "gitmux"
brew "gnu-sed"
brew "unbound"
brew "gnutls"
brew "libassuan"
brew "pinentry"
brew "gnupg"
brew "go"
brew "go-blueprint"
brew "pkgconf"
brew "python@3.13"
brew "gobject-introspection"
brew "golangci-lint"
brew "gptfdisk"
brew "python@3.12"
brew "librsvg"
brew "graphviz"
brew "gtk+3"
brew "gtk4"
brew "hadolint"
brew "himalaya"
brew "htop"
brew "imagemagick"
brew "jq"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "libfido2"
brew "lsusb"
brew "maclaunch"
brew "mole"
brew "mysql"
brew "mysql@8.4"
brew "neovim"
brew "nmap"
brew "node@18"
brew "numpy", link: false
brew "openjdk"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "plantuml"
brew "pnpm"
brew "poppler"
brew "postgresql@14"
brew "pre-commit", link: false
brew "pygobject3"
brew "python@3.10"
brew "r"
brew "redis"
brew "ripgrep"
brew "rust"
brew "semgrep"
brew "shellcheck"
brew "slackdump"
brew "sonar-scanner"
brew "sshpass"
brew "starship"
brew "stow"
brew "tailscale"
brew "telnet"
brew "testdisk"
brew "topgrade"
brew "tree"
brew "uv"
brew "vhs"
brew "watch"
brew "wimlib"
brew "yq"
brew "antoniorodr/memo/memo"
brew "goodwithtech/r/dockle"
brew "messense/macos-cross-toolchains/armv7-unknown-linux-gnueabihf"
brew "snyk/tap/snyk"
brew "steipete/tap/bird"
brew "steipete/tap/imsg"
brew "steipete/tap/remindctl"
brew "supreme-gg-gg/tap/instagram-cli"
cask "applepi-baker"
cask "balenaetcher"
cask "bruno"
cask "chatgpt"
cask "chromedriver"
cask "cleanshot"
cask "codex"
cask "steipete/tap/codexbar"
cask "codux"
cask "dbeaver-community"
cask "ghostty"
cask "gitbutler"
cask "keepingyouawake"
cask "keyboardcleantool"
cask "launchcontrol"
cask "mac-mouse-fix"
cask "macfuse"
cask "mactex"
cask "ollama-app"
cask "opencode-desktop"
cask "pearcleaner"
cask "publish-or-perish"
cask "raspberry-pi-imager"
cask "raycast"
cask "screen-studio"
cask "slack"
cask "soundsource"
cask "spotify"
cask "utm"
cask "visual-studio-code"
cask "warp"
cask "xquartz"
cask "zed"
cask "zen"
cask "zotero"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "bruno-api-client.bruno"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "kilocode.kilo-code"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "rust-lang.rust-analyzer"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "usernamehw.errorlens"
go "github.com/rhysd/actionlint/cmd/actionlint"
go "golang.org/x/tools/cmd/deadcode"
go "github.com/KyleBanks/depth/cmd/depth"
go "github.com/mibk/dupl"
go "github.com/melkeydev/go-blueprint"
go "github.com/ofabry/go-callvis"
go "github.com/uudashr/gocognit/cmd/gocognit"
go "github.com/jgautheron/goconst/cmd/goconst"
go "github.com/go-critic/go-critic/cmd/gocritic"
go "github.com/fzipp/gocyclo/cmd/gocyclo"
go "github.com/loov/goda"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
go "github.com/alpkeskin/mosint/v3/cmd/mosint"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
go "mvdan.cc/unparam"
go "golang.org/x/tools/go/analysis/passes/unusedresult/cmd/unusedresult"
cargo "cargo-update"
cargo "cross"
